Offwind.Solver/TestCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |                                                  |
| \\      /  F ield        | OpenFOAM:            The Open Source CFD Toolbox |
|  \\    /   O peration    | Version:             1.5                         |
|   \\  /    A nd          | Web:                 http://www.OpenFOAM.org     |
|    \\/     M anipulation | Discretizer - Setup: http://www.discretizer.org  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    west
    {
        type            zeroGradient;
    }
    east
    {
        type            fixedValue;
        value           uniform 0;
    }
    north
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    south
    {
        type            fixedValue;
        value           uniform 0;
    }
}
